#+TITLE: Arrays
#+AUTHOR: Angel Dhakal
#+DATE: 2025-12-17
#+DESCRIPTION: Documentation on bash arrays.
#+KEYWORDS: bash, mastery, documentation, technical-docs, list, collections, arrays, inddex, indices, length, array-operations, dynamic-data, linux, linux-docs, arrays, shell
#+OPTIONS: ^:{} num:nil toc:5 html-postamble:nil
#+XZHH_PUB_DATE: 2025-12-17
#+XZHH_UPDATED_DATE: 2025-12-17
#+EXPORT_FILE_NAME: /home/angel/xynapz/angeld/site-content/knowledge_base/linux/bash/arrays.html
#+XZHH_ORDER: 6

** Length of an array.
To get the length of an array, we can use the ~#~ symbol in bash, along with ~*~, or ~@~ symbol which dereferences all members of arrays. This combo does two things, first we dereference all the memebrs of the array using the ~*~ or ~@~ symbol, and then the ~#~ symbol counts the numbers of positional parameters or numbers of elements in that dereferenced variable, i.e. an array.

*The syntax:*
#+begin_src bash
array=(1 2 3 5 8 9)
echo "${#array[@]}"
#+end_src

#+RESULTS:
: 6
